Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/housing_grants_and_schemes/home_energy_saving_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Better Energy Homes Scheme
ga: Scéim um Thithe Fuinnimh níos Fearr

source: The Better Energy Homes Scheme provides grants to homeowners to improve energy efficiency in their homes
ga: Soláthraíonn an Scéim um Thithe Fuinnimh níos Fearr deontais d’úinéirí tí áirithe chun éifeachtacht fuinnimh a fheabhsú ina gcuid tithe

source: Landlords and owners of more than one property can also apply for a grant under the scheme
ga: Is féidir le tiarnaí talún agus le h-úinéirí a bhfuil níos mó ná teach amháin acu iarratas a dhéanamh ar dheontas faoin scéim freisin

source: It is administered by the Sustainable Energy Authority of Ireland (SEAI)
ga: Is é Údarás Fuinneamh Inmharthana Éireann (ÚFIÉ) a riarann an scéim

source: Grants are available for the following energy-saving work:
ga: Is féidir deontas a fháil don obair seo a leanas a bhaineann le coigilt fuinnimh:

source: • Wall insulation - for example, cavity wall, internal dry lining or external insulation
ga: • Insliú balla - mar shampla, balla cuasach, tirimlíneáil inmheánach nó insliú seachtrach

source: • Installation of a high-efficiency boiler (more than 90% efficiency) including a heating controls upgrade
ga: • Athsholáthar ar choire ardéifeachtachta (níos mó ná éifeachtacht 90%) lena n-áirítear uasghrádú ar rialtáin teasa

source: • A Building Energy Rating (BER) after the energy-saving work is carried out (you must get this BER to qualify for the grant)
ga: • Rátáil Fuinnimh an Fhoirgnimh (BER) tar éis a ndéantar an obair choigilte fuinnimh - tá an BER seo riachtanach chun deontas a fháil

source: See the Application Guide (pdf) for summary performance requirements under each of these measures
ga: Féach an Treoirleabhar Feidhme (pdf) le haghaidh achoimre ar riachtanais feidhmíochta maidir le gach ceann de na bearta sin

source: Your contractor(s) must carry out the works in accordance with detailed standards set out in the Contractor Code of Practice and Technical Specification (pdf)
ga: Ní mór do chonraitheoir(í) an obair a dhéanamh de réir na gcaighdeán mionsonraithe atá leagtha amach i gCód Cleachtais agus Sonraíochta Teicniúil Conraitheoirí (pdf)

source: SEAI publishes detailed FAQs about the Better Energy Homes Scheme
ga: Tá Ceisteanna Coitianta mionsonraithe maidir leis an Scéim na dTithe um Fhuinneamh níos Fearr foilsithe ag Údarás Fuinneamh Inmharthana Éireann (ÚFIÉ)

source: You must have grant approval before you buy materials or start any grant-funded energy-saving work
ga: Caithfidh tú an deontas a bheith ceadaithe duit sula gceannaíonn tú ábhar ar bith nó sula gcuireann tú tús le hobair choigilte fuinnimh ar bith atá cuimsithe ag an deontas

source: If you have already started work, you will not be eligible for a grant
ga: Má tá tús curtha agat le hobair cheana féin, ní bheidh tú incháilithe do dheontas

source: The grant approval remains valid for 6 months after the date it is issued
ga: Maireann faomhadh ar an deontas ar feadh 6 mhí i ndiaidh an dáta eisiúna

source: However, a before BER can be done ahead of grant approval and could prove useful if you are uncertain about your energy-saving options or what to get done first
ga: Mar sin féin, is féidir an BER roimh obair a dhéanamh sula gceadaítear an deontas agus d’fhéadfadh a leithéid a bheith úsáideach mura bhfuil tú cinnte faoi roghanna coigilte fuinnimh nó cad atá le déanamh i dtús báire

source: To qualify for a grant you must:
ga: Le bheith incháilithe do dheontas caithfidh tú:

source: • Be the owner of a dwelling built before 2006
ga: • A bheith mar úinéir teaghaise a tógadh roimh 2006

source: • Use a contractor from SEAI’s registered list
ga: • Conraitheoir a úsáid ó liosta cláraithe ÚFIÉ

source: • Use newly fitted materials and products
ga: • Úsáid a bhaint as ábhair agus as earraí a feistíodh as an nua

source: • Have work done that complies with the required standards
ga: • Obair a chomhlíonann na caighdeáin riachtanacha a chinntiú

source: • Have a BER carried out after the works are done
ga: • BER a dhéanamh i ndiaidh críche na hoibreacha

source: • Use a BER assessor from SEAI’s National Register
ga: • Measúnóir BER ó liosta cláraithe ÚFIÉ a úsáid

source: You may not get a grant if:
ga: Ní bhfaighidh tú deontas más rud é:

source: • You are replacing your existing boiler with a typical efficiency boiler of less than 90% efficiency
ga: • Go bhfuil do choire reatha á athsholáthar agat le coire éifeachtachta coitianta a bhfuil níos lú ná 90% éifeachtacht ag baint leis

source: • You replace your boiler but do not replace the heating controls
ga: • Go bhfuil athsholáthar déanta ar an gcoire, ach gan athsholáthar ar bith déanta ar na rialtáin teasa

source: • The measures do not comply with the required standards
ga: • Nach gcloínn an obair leis na caighdeáin chuí

source: • The relevant measure (the work on your home) was already incentivised under another grant programme
ga: • Go bhfuil an obair clúdaithe faoi íocaíocht ar bith a fuarthas faoi scéim eile deontais

source: How to find out if your home would benefit from energy-saving work
ga: Conas fáil amach an mbainfeadh do theach leas as obair choigilte fuinnimh

source: You can use the Home Energy Self Survey to identify areas in your home which could be improved to increase its energy efficiency
ga: Is féidir leat Féinsuirbhé Baile a dhéanamh chun réimsí a aithint i do theach a bhféadfaí feabhas a chur orthu chun éifeachtacht fuinnimh a fheabhsú

source: You can also get a Building Energy Rating (BER) done in advance of any works
ga: Is féidir leat Rátáil Fuinnimh an Fhoirgnimh (BER) a mheasúnú freisin

source: A BER assessor will energy rate your home and provide you with an advisory report, which will help identify areas that could be improved to increase the energy efficiency of your home
ga: Déanfaidh measúnóir BER rátáil fuinnimh ar do theach agus tabharfaidh sé tuairisc chomhairleach duit, a chabhróidh leat réimsí a aithint atá le feabhsú chun éifeachtacht fuinnimh a mhéadú

source: In general, you will not need planning permission for the measures that are grant-aided under this scheme, though you may require it for external wall insulation
ga: Go ginearálta, ní bheidh cead pleanála ag teastáil le haghaidh obair a fhaigheann cúnamh deontais faoin scéim, ach d’fhéadfadh cead pleanála a bheith ag teastáil maidir le hinsliú an bhalla seachtraigh

source: This will depend on matters such as whether the insulation will affect the external appearance of the building or whether the building is a protected structure
ga: Beidh an riachtanas maidir le cead pleanála ag brath ar roinnt rudaí, mar shampla, cibé an mbeidh tionchar ar chuma seachtrach an fhoirgnimh nó cibé an struchtúr atá faoi chosaint an foirgneamh

source: Contact your local authority to check if you need planning permission
ga: Déan teagmháil le d’údarás áitiúil chun fáil amach an bhfuil cead pleanála ag teastáil

source: Getting the work done safely
ga: Obair shábháilte a chinntiú

source: Under the Regulations governing safety, health and welfare at work, homeowners are obliged to ensure that construction work on their home is carried out by competent people
ga: Faoi na Rialacháin a dhéanann rialú ar chúrsaí sábháilteachta, sláinte agus leasa san áit oibre, ní mór d’úinéirí tí a chinntiú gur daoine inniúil a dhéanann obair thógála ar bith a dhéantar ar a dteach

source: Read more, including a guide for homeowners (pdf) and some Frequently Asked Questions, on the website of the Health and Safety Authority
ga: Tá tuilleadh le léamh faoi seo ar láithreán gréasáin an Údaráis Sláinte agus Sábháilteachta, idir an Treoirleabhar le haghaidh Úinéirí Tí (pdf) agus cuid de na Ceisteanna Coitianta

source: As well as getting a grant under the Better Energy Homes Scheme, you may be able to claim a tax credit on part of the cost of the work
ga: Chomh maith le deontas a fháil faoin Scéim na dTithe um Fhuinnimh níos Fearr, seans go mbeidh tú in ann creidmheas cánach a éileamh ar chuid de chostas na hoibre

source: Read more in our document on the Home Renovation Incentive and in these FAQs published by Revenue
ga: Tá tuilleadh le léamh faoi seo sa doiciméad dár gcuid a bhaineann leis an Dreasacht Athchóirithe Tí agus sna Ceisteanna Coitianta seo arna bhfoilsiú ag na Coimisinéirí Ioncaim

source: Grants are paid after the work is completed and you have paid your contractor
ga: Íoctar deontais tar éis don obair a bheith curtha i gcrích agus conraitheoir a bheith íoctha agat

source: Applications received from specific offshore islands are eligible for 50% additional grant support
ga: Bíonn iarratais a fhaightear ó oileáin ar leith amuigh ón gcósta incháilithe do 50% breise de chúnamh deontais

source: If the cost of the work (including VAT) is less than the maximum grant amount, you will get a grant for the actual cost of the work
ga: Má bhíonn costas na hoibre (lena n-áirítear CBL) níos lú ná uasmhéid an deontais, gheobhaidh tú deontas do chostas iarbhír na hoibre

source: If you are claiming a tax credit under the Home Renovation Incentive, the amount of expenditure that qualifies for the credit will be reduced, as outlined in this FAQ
ga: Má tá creidmheas cánach á éileamh agat faoin Dreasacht Athchóirithe Tí, déanfar an méid caiteachais atá incháilithe le haghaidh creidmheas a laghdú, mar atá leagtha amach sa Cheist Choitianta seo

source: Bonuses: A bonus of €300 is payable when you have completed 3 qualifying measures and a further €100 is payable on completion of a 4th measure
ga: Bónais: Tá bónas €300 iníoctha nuair atá 3 bheart incháilithe curtha i gcrích ar theach, agus tá €100 breise iníoctha nuair a chuirtear an 4ú beart i gcrích

source: The full grant history of your home is taken into account when calculating whether a bonus is due
ga: Cuirtear san áireamh stair iomlán na deontas atá faighte i dtaobh do thí nuair atá cinneadh á dhéanamh faoi bhónas a bheith dlite nó gan é a bheith dlite

source: A BER does not count as a measure when calculating entitlement to a bonus
ga: Ní chuirtear BER san áireamh mar bheart agus cáilíocht le haghaidh bónais á ríomh

source: The following table shows the maximum levels of grant and the bonuses payable for extra measures
ga: Tá leagtha amach sa tábla seo thíos uasleibhéil na ndeontas agus na mbónas atá le híoc maidir le bearta breise

source: │Attic insulation │€300 │
ga: │Insliú áiléir │€300 │

source: │Cavity wall insulation │€300 │
ga: │Insliú bhalla cuasaigh │€300 │

source: │Wall insulation - internal dry lining │ │
ga: │Insliú bhalla - líneáil thirim inmheánach │ │

source: │- Apartment (any) or mid-terrace house │€1,200 │
ga: │- Árasán (ar bith) nó teach lár-ardáin │€1,200 │

source: │- Semi-detached or end of terrace house │€1,800 │
ga: │- Teach leathscoite nó ag deireadh ardáin │€1,800 │

source: │- Detached house │€2,400 │
ga: │- Teach scoite │€2,400 │

source: │Wall insulation - external │ │
ga: │Insliú bhalla - seachtrach │ │

source: │- Apartment (any) or mid-terrace house │€2,250 │
ga: │- Árasán (go léir) nó teach lár-ardáin │€2,250 │

source: │- Semi-detached or end of terrace house │€3,400 │
ga: │- Teach leathscoite nó ag deireadh ardáin │€3,400 │

source: │- Detached house │€4,500 │
ga: │- Teach scoite │€4,500 │

source: │High efficiency (more than 90% efficiency) gas or oil fired boiler with │€700 │ │heating controls upgrade │ │
ga: │Coire ardéifeachtachta (níos mó ná 90% éifeachtachta) gáis nó ola le huasghrádú ar rialtáin teasa │€700 │

source: │Heating controls upgrade │€600 │
ga: │Uasghrádú ar rialtáin teasa │€600 │

source: │A BER assessment after works are done (maximum of 1 grant payable per │€50 │
ga: │Measúnú BER i ndiaidh na hoibre (Ní íocfar ach uair amháin i leith an tí) │€50 │

source: │Bonus payment after 3rd measure │€300 │
ga: │Íocaíocht bhónais i ndiaidh an tríú bhirt │€300 │

source: │Bonus payment after 4th measure │€100 │
ga: │Íocaíocht bhónais i ndiaidh an cheathrú bhirt │€100 │

source: You can apply online or else download an application form (pdf)
ga: Is féidir iarratas ar líne a dhéanamh nó foirm iarratais (pdf) a íoslódáil

source: Online applications will get a response within 3 working days
ga: Gheobhaidh iarratais ar líne freagra laistigh 3 lá

source: Postal applications will get a response within 20 working days
ga: Gheobhaidh iarratais phoist freagra laistigh 20 lá oibre

source: SEAI has produced an information leaflet (pdf) and a guide to help with your application (pdf)
ga: Tá treoir a chabhraíonn leat le d’iarratas (pdf) foilsithe ag ÚFIÉ, chomh maith le ceisteanna coitianta mionsonraithe faoin Scéim um Thithe Fuinnimh níos Fearr

source: Sustainable Energy Authority of Ireland
ga: Údarás Fuinneamh Inmharthana Éireann
